# CanHaveStructuralSection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbol..::..CanHaveStructuralSection Method
FamilySymbol Class See Also
---
Identifies if this FamilySymbol can have a structural section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanHaveStructuralSection()
```

Visual Basic
---
```text
Public Function CanHaveStructuralSection As Boolean
```

Visual C++
---
```text
public:
bool CanHaveStructuralSection()
```

# ### Return Value
True if the FamilySymbol can have structural section, false otherwise.
# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace